Repository: StanfordBDHG/LLMonFHIR
Catalog: LLMonFHIR/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, zh_hans

# SUMMARY_PROMPT_CONTENT_OPENAI
source: Your task is to private a title and compact summary for an FHIR resource from the user's clinical record. You should provide the title and summary in the following locale: {{LOCALE}}. Your response should contain two lines without headings, markdown formatting, or any other structure beyond two lines. Directly provide the content without any additional structure or an introduction. Another computer program will parse the output. 1. Line: A 1-5 Word summary of the FHIR resource that immediately identifies the resource and provides the essential information at a glance. Do NOT use a complete sentence; instead, use a formatting typically used for titles in computer systems. 2. Line: Provide a short one-sentence summary of the resource in less than 100 words. Ensure that the summary only focuses on the essential information that a patient would need and, e.g., excludes the person who prescribed a medication or similar metadata. Ensure that all clinically relevant data is included, which allows us to use the summary in additional prompts where using the complete JSON might not be feasible. The following JSON representation defines the FHIR resource that you should provide a title and summary for: {{FHIR_RESOURCE}}
de: Ihre Aufgabe ist es, einen Titel und eine kompakte Zusammenfassung für eine FHIR-Ressource aus der klinischen Akte des Benutzers zu erstellen. Sie sollten den Titel und die Zusammenfassung in dem folgenden Gebietsschema bereitstellen: {{LOCALE}}. Ihre Antwort sollte aus zwei Zeilen bestehen, ohne Überschriften, Markdown-Formatierung oder eine andere Struktur, die über zwei Zeilen hinausgeht. Geben Sie den Inhalt direkt und ohne zusätzliche Struktur oder eine Einleitung an. Ein anderes Computerprogramm wird die Ausgabe parsen. 1. Zeile: Eine 1-5-Wort-Zusammenfassung der FHIR-Ressource, die die Ressource sofort identifiziert und die wesentlichen Informationen auf einen Blick liefert. Verwenden Sie KEINEN vollständigen Satz, sondern eine Formatierung, die typischerweise für Titel in Computersystemen verwendet wird. 2. Zeile: Geben Sie eine kurze Zusammenfassung der Ressource in einem Satz mit weniger als 100 Wörtern. Achten Sie darauf, dass sich die Zusammenfassung nur auf die wesentlichen Informationen konzentriert, die ein Patient benötigen würde, und z. B. die Person, die ein Medikament verschrieben hat, oder ähnliche Metadaten ausschließt. Es muss sichergestellt werden, dass alle klinisch relevanten Daten enthalten sind, damit wir die Zusammenfassung in zusätzlichen Aufforderungen verwenden können, bei denen die Verwendung des vollständigen JSON nicht möglich ist. Die folgende JSON-Darstellung definiert die FHIR-Ressource, für die Sie einen Titel und eine Zusammenfassung angeben sollten: {{FHIR_RESOURCE}}
es: Su tarea consiste en privado un título y un resumen compacto para un recurso FHIR de la historia clínica del usuario. Debe proporcionar el título y el resumen en la siguiente configuración regional: {{LOCALE}}. Su respuesta debe contener dos líneas sin encabezados, formato markdown o cualquier otra estructura más allá de dos líneas. Proporcione directamente el contenido sin ninguna estructura adicional ni introducción. Otro programa informático analizará la salida. 1. Línea: Un resumen de 1-5 palabras del recurso FHIR que identifique inmediatamente el recurso y proporcione la información esencial de un vistazo. NO utilice una frase completa; en su lugar, utilice un formato típicamente utilizado para títulos en sistemas informáticos. 2. Línea: Proporcione un breve resumen de una sola frase del recurso en menos de 100 palabras. Asegúrese de que el resumen sólo se centra en la información esencial que necesitaría un paciente y, por ejemplo, excluya la persona que prescribió un medicamento o metadatos similares. Garantizar que se incluyen todos los datos clínicamente relevantes, lo que nos permite utilizar el resumen en indicaciones adicionales en las que utilizar el JSON completo podría no ser factible. La siguiente representación JSON define el recurso FHIR para el que debe proporcionar un título y un resumen: {{FHIR_RESOURCE}}
fr: Votre tâche consiste à fournir un titre et un résumé compact pour une ressource FHIR à partir du dossier clinique de l'utilisateur. Vous devez fournir le titre et le résumé dans la locale suivante : {{LOCALE}}. Votre réponse doit contenir deux lignes sans titres, formatage markdown ou toute autre structure au-delà de deux lignes. Fournissez directement le contenu sans structure supplémentaire ni introduction. Un autre programme informatique analysera le résultat. 1. Ligne : Un résumé de 1 à 5 mots de la ressource FHIR qui identifie immédiatement la ressource et fournit les informations essentielles en un coup d'œil. N'utilisez PAS de phrase complète, mais plutôt un formatage généralement utilisé pour les titres dans les systèmes informatiques. 2. Ligne : Fournir un résumé d'une phrase de la ressource en moins de 100 mots. Veillez à ce que le résumé se concentre uniquement sur les informations essentielles dont un patient aurait besoin et excluez, par exemple, la personne qui a prescrit un médicament ou d'autres métadonnées similaires. Veiller à ce que toutes les données cliniques pertinentes soient incluses, ce qui nous permet d'utiliser le résumé dans des invites supplémentaires lorsqu'il n'est pas possible d'utiliser le JSON complet. La représentation JSON suivante définit la ressource FHIR pour laquelle vous devez fournir un titre et un résumé : {{FHIR_RESOURCE}}
zh_hans: 您的任务是为用户临床记录中的 FHIR 资源创建标题和摘要。您应使用以下语言提供标题和摘要： {{LOCALE}}。 您的回复应包含两行内容，不含标题、markdown 格式或超出两行的任何其他结构。直接提供内容，无需任何附加结构或引言。另一个计算机程序将解析输出。 1. 行： 1-5 个字的 FHIR 资源摘要，可立即识别资源并提供一目了然的基本信息。请勿使用完整的句子，而应使用计算机系统中通常用于标题的格式。 2. 行： 提供少于 100 字的简短单句资源摘要。确保摘要只关注患者需要的基本信息，例如，不包括开药人或类似元数据。确保包含所有临床相关数据，以便在无法使用完整 JSON 的情况下在附加提示中使用摘要。 以下 JSON 表示法定义了您应提供标题和摘要的 FHIR 资源： {{FHIR_RESOURCE}}

source: The medical record does not include any FHIR resources for the search term %@.
de: Die Krankenakte enthält keine FHIR-Ressourcen für den Suchbegriff %@.
es: La historia clínica no incluye ningún recurso FHIR para el término de búsqueda %@.
fr: Le dossier médical ne contient aucune ressource FHIR pour le terme de recherche %@.
zh_hans: 病历中不包含搜索词 %@ 的任何 FHIR 资源。

# This is the summary of the requested %@: %@
source: This is the summary of the requested %1$@: %2$@
de: Dies ist die Zusammenfassung der angeforderten %1$@: %2$@
es: Este es el resumen del %1$@ solicitado: %2$@
fr: Voici le résumé de la demande %1$@ : %2$@
zh_hans: 这是请求 %1$@ 的摘要： %2$@

source: Total Number of Resources: %lld
de: Gesamtzahl der Ressourcen: %lld
es: Número total de recursos: %lld
fr: Nombre total de ressources : %lld
zh_hans: 资源总数： %lld

source: Use HealthKit Resources
de: Nutze HealthKit Daten
es: Utilizar los recursos de HealthKit
fr: Utiliser les ressources de HealthKit
zh_hans: 使用 HealthKit 资源

# WELCOME_AREA1_DESCRIPTION
source: Health data is provided using your provides FHIR patient data API using the Apple Health app.
de: Gesundheitsdaten werden über die FHIR-Patientendaten-API Ihres Anbieters über die Apple Health App bereitgestellt.
es: Los datos de salud se proporcionan mediante su API de datos de paciente FHIR utilizando la aplicación Apple Health.
fr: Les données de santé sont fournies via votre API de données de patient FHIR utilisant l'application Apple Health.
zh_hans: 使用苹果健康应用程序的FHIR患者数据API提供健康数据。

# WELCOME_AREA1_TITLE
source: Inspect Your Health Data
de: Ihre Gesundheitsdaten überprüfen
es: Inspeccionar sus Datos de Salud
fr: Inspecter Vos Données de Santé
zh_hans: 检视您的健康数据

# WELCOME_AREA2_DESCRIPTION
source: LLM on FHIR allows you to summarize and interpret your clinical data.
de: LLM on FHIR ermöglicht es Ihnen, Ihre klinischen Daten zusammenzufassen und zu interpretieren.
es: LLM en FHIR le permite resumir e interpretar sus datos clínicos.
fr: LLM sur FHIR vous permet de résumer et d'interpréter vos données cliniques.
zh_hans: LLM on FHIR允许您总结和解释您的临床数据。

# WELCOME_AREA2_TITLE
source: Summarize & Interpret Your Data
de: Ihre Daten zusammenfassen und interpretieren
es: Resumir e Interpretar sus Datos
fr: Résumer et Interpréter Vos Données
zh_hans: 总结和解释您的数据

# WELCOME_AREA3_DESCRIPTION
source: Use the chat functionality to ask follow up questions and get more information about your clinical records.
de: Verwenden Sie die Chat-Funktion, um Nachfragen zu stellen und weitere Informationen zu Ihren klinischen Aufzeichnungen zu erhalten.
es: Utilice la funcionalidad de chat para hacer preguntas de seguimiento y obtener más información sobre sus registros clínicos.
fr: Utilisez la fonctionnalité de chat pour poser des questions de suivi et obtenir plus d'informations sur vos dossiers cliniques.
zh_hans: 使用聊天功能询问后续问题并获取更多有关您的临床记录的信息。

# WELCOME_AREA3_TITLE
source: Learn More About Your Data
de: Mehr über Ihre Daten erfahren
es: Aprender más sobre sus Datos
fr: En savoir plus sur Vos Données
zh_hans: 了解更多关于您的数据

# WELCOME_BUTTON
source: Learn More
de: Mehr erfahren
es: Aprender más
fr: En savoir plus
zh_hans: 了解更多

# WELCOME_SUBTITLE
source: Demystifying Health Records
de: Entmystifizierung von Gesundheitsdaten
es: Descifrando los Registros de Salud
fr: Démystifier les Dossiers de Santé
zh_hans: 解析健康记录

source: Your Health Records
de: Dein Gesundheitsdaten
es: Su historial médico
fr: Votre dossier médical
zh_hans: 您的健康记录

source: Customize the %@.
es: Personaliza el %@.
fr: Personnalisez le %@.
zh_hans: 自定义 %@。

# FHIR_RESOURCES_INTERPRETATION_SECTION
source: Interpretation
es: Interpretación
fr: Interprétation
zh_hans: 口译

source: LLM on FHIR
es: LLM sobre FHIR
fr: LLM sur FHIR
zh_hans: 关于 FHIR 的法律硕士

source: Resource Limit
es: Límite de recursos
fr: Limite des ressources
zh_hans: 资源限制

source: Resource Limit %lld
es: Límite de recursos %lld
fr: Limite de ressources %lld
zh_hans: 资源限制 %lld

# WELCOME_TITLE
source: LLM on FHIR
es: LLM en FHIR
fr: LLM sur FHIR
